#Использовать v8runner
#Использовать logos

Перем Лог;

// 1. Подключаюсь к базе dev src-154
//		- Логин % -l
//		- Пароль % -pwd
//		- Сервер 
//		- Имя ИБ
//		- Версия платформы
// 2. Обновляюсь из хранилища
//		- Логин хранилища % -ls
//		- Пароль хранилища % -pwds
// 3. Сохранию cf
//		- Временный каталог
// 4. Подключаюсь к базе приемнику
//		- Логин Приемника % -lt
//		- Пароль Приемника % -pwdt
//		- Сервер Приемника
//		- Имя ИБ Приемника
//		- Версия платформы Приемника
// 5. Загружаю cf
// 		- Временный каталог
// 6. Накатываю обновления на базу
// 7. Удаляем cf

Функция ПодготовитьСтруктуруПараметров()
	
	//Srvr="std-dapp03.stdp.ru";Ref="test-prod-ut-spb-a.noskov-20210603";

	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ЛогинИсточник", 			"Носков_А_А");
	ПараметрыВыполнения.Вставить("ПарольИсточник",			"081172370");
	ПараметрыВыполнения.Вставить("СерверИсточник",			"std-dapp03.stdp.ru");
	ПараметрыВыполнения.Вставить("БазаИсточник",			"test-prod-ut-spb-a.noskov-20210603");
	ПараметрыВыполнения.Вставить("ВерсияПлатформыИсточник", "8.3.10");

	ПараметрыВыполнения.Вставить("ЛогинХранилища", 			"Галашенкова_И_А");
	ПараметрыВыполнения.Вставить("ПарольХранилища",			"");
	ПараметрыВыполнения.Вставить("АдресХранилища",			"\\regulations_1c.fs.stdp.ru\repos\UT-SRS-154");
	
	ПараметрыВыполнения.Вставить("ЛогинПриемник", 			"");
	ПараметрыВыполнения.Вставить("ПарольПриемник",			"");
	ПараметрыВыполнения.Вставить("СерверПриемник",			"");
	ПараметрыВыполнения.Вставить("БазаПриемник",			"");
	ПараметрыВыполнения.Вставить("ВерсияПлатформыПриемник", "8.3.10");

	ПараметрыВыполнения.Вставить("ВременнаяПапка", 			"C:\Users\a.noskov\Documents\Work\SRS-154 (Союз отважных)");

	Возврат ПараметрыВыполнения;

КонецФункции

Процедура ЗаполнитьНастройкиИзПараметров()

	СоответствиеАргументов = Новый Соответствие;
	СоответствиеАргументов.Вставить("-l", 		"ЛогинИсточник");
	СоответствиеАргументов.Вставить("-pwd", 	"ПарольИсточник");
	СоответствиеАргументов.Вставить("-ls", 		"ЛогинХранилище");
	СоответствиеАргументов.Вставить("-pwds", 	"ПарольХранилище");
	СоответствиеАргументов.Вставить("-lt", 		"ЛогинПриемник");
	СоответствиеАргументов.Вставить("-pwdt", 	"ПарольПриемник");

	// Для Ит = 0 По АргументыКоманднойСтроки.Количество() - 1 Цикл

	// 	Аргумент = АргументыКоманднойСтроки[Ит];
	// 	ИмяПоляНастройки = СоответствиеАргументов.Получить(Аргумент);

	// 	Если ИмяПоляНастройки <> Неопределено Тогда
	// 		ЗначениеАргумента = АргументыКоманднойСтроки[Ит + 1];
	// 		ПараметрыВыполнения[ИмяПоляНастройки] = ЗначениеАргумента;
	// 	КонецЕсли;	

	// КонецЦикла;	

КонецПроцедуры	

Процедура ВыполнитьОбновление(Параметры)

	//----------------------------------------------------------------------------------------

	КонфигураторИсточник = Новый УправлениеКонфигуратором();

	ШаблонПодключения = "/S %1\%2";
	СтрокаПодключения = СтрШаблон(ШаблонПодключения, Параметры.СерверИсточник, Параметры.БазаИсточник);

	//Лог.Информация(СтрокаПодключения);

	КонфигураторИсточник.ИспользоватьВерсиюПлатформы(Параметры.ВерсияПлатформыИсточник);
	КонфигураторИсточник.УстановитьКонтекст(СтрокаПодключения, Параметры.ЛогинИсточник, Параметры.ПарольИсточник);

	Лог.Информация("Обновляем базу их хранилища");
	КонфигураторИсточник.ОбновитьКонфигурациюБазыДанныхИзХранилища(Параметры.АдресХранилища, Параметры.ЛогинХранилища, Параметры.ПарольХранилища);

	//----------------------------------------------------------------------------------------

	ВременныйФайлКонфигурации = ПолучитьИмяВременногоФайла(".сf");

	Лог.Информация("Выгружаем CF во временный файл");
	КонфигураторИсточник.ВыгрузитьКонфигурациюВФайл(ВременныйФайлКонфигурации);

	//----------------------------------------------------------------------------------------

	КонфигураторПриемник = Новый УправлениеКонфигуратором();
	СтрокаПодключения = СтрШаблон(ШаблонПодключения, Параметры.СерверПриемник, Параметры.БазаПриемник);

	КонфигураторПриемник.ИспользоватьВерсиюПлатформы(Параметры.ВерсияПлатформыИсточник);
	КонфигураторПриемник.УстановитьКонтекст(СтрокаПодключения, Параметры.ЛогинПриемник, Параметры.ПарольПриемник);

	Лог.Информация("Загружаем файл конфигурации в базу DS");

	КонфигураторПриемник.ЗагрузитьКонфигурациюИзФайла(ВременныйФайлКонфигурации, Истина);

	//----------------------------------------------------------------------------------------

	Лог.Информация("Удаляем временный файл");
	УдалитьФайлы(ВременныйФайлКонфигурации);
	
КонецПроцедуры	

Лог = Логирование.ПолучитьЛог("oscript.script.DS-stand-update");
//Лог.УстановитьУровень(УровниЛога.Отладка);

Параметры = ПодготовитьСтруктуруПараметров();

ВыполнитьОбновление(Параметры);

